---
kind: type
id: T:Autodesk.Revit.DB.DimensionSegment
source: html/36b254a0-3dc5-7bdc-d6b4-986e5d82ddbf.htm
---
# Autodesk.Revit.DB.DimensionSegment

A segment of a dimension within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class DimensionSegment : APIObject
```